{
  "olcr7u": {
    "jobTitle": "Revenue Operations Manager",
    "companyName": "Arcadia",
    "introText": "I bring a proven track record in managing growth and operations that align with Arcadia's mission to revolutionize clean energy access.",
    "bulletPoints": [
      "**Leadership in Growth Strategy:** While I was Growth Ops Manager at Countable, I led growth strategy that resulted in a 150% increase in partnerships, showcasing my ability to drive impactful initiatives.",
      "**Market Expansion Expertise:** While I was Launch Manager at Uber, I successfully built new markets from the ground up, demonstrating my capability in managing diverse and challenging portfolios.",
      "**Data-Driven Decision Making:** At CloudKitchens, as a Product Manager, I rolled out robotics to 100+ locations, enhancing support efficiency by 80%, emphasizing my proficiency in data and project management.",
      "**Client Relationship Management:** During my tenure as Regional Manager at Ritual, I improved restaurant satisfaction by 40%, ensuring client goals were met and markets were thriving.",
      "**Cross-Functional Collaboration:** At Countable, my leadership in getting our app featured multiple times on the App Store highlights my ability to work collaboratively across teams to achieve significant milestones."
    ],
    "relevantSkills": [
      "Project Management",
      "Data Analysis",
      "Cross-Functional Collaboration",
      "Strategic Growth Planning",
      "Client Relationship Management"
    ],
    "jobContent": "Job Application for Revenue Operations Manager at ArcadiaBack to jobsNewRevenue Operations ManagerUnited StatesApplyWho We Are \n\nArcadia is the technology company empowering energy innovators and consumers to fight the climate crisis. Our software and APIs are revolutionizing an industry held back by outdated systems and institutions by creating unprecedented access to the data and clean energy needed to make a decarbonized energy grid possible.\n\nIn 2014, Arcadia set out on its mission to break the fossil fuel monopoly and since then we have been knocking down the institutional barriers to unlock decarbonization. To date, we have connected hundreds of thousands of consumers and small businesses with high-quality clean energy options. Fast forward to today, and now, we’re thinking even bigger. We have launched Arcadia Platform, an industry-defining SaaS platform that empowers developers and energy innovators to deliver their own custom, personalized energy experiences, accelerating the transformation of the industry from an analog energy system into a digitized information network.\n\nTackling one of the world’s biggest challenges requires out-of-the-box thinking & diverse perspectives. We’re building a team of individuals from different backgrounds, industries, & educational experiences. If you share our passion for ushering in the era of the clean electron, we look forward to learning what you would uniquely bring to Arcadia!\n\nWhat we’re looking for:\n\nWe are seeking a highly motivated leader to join our Community Solar Revenue Operations team. This individual will be responsible for managing a portfolio of community solar projects in a number of different markets. The ideal candidate is a driven self-starter that is motivated to leverage their project management, data, and leadership skills to fight climate change!\n\nArcadia is open to fully remote candidates and employees have access to co-working spaces.\n\n#LI-REMOTE\n\nWhat you'll do:\n\nManage a portfolio of Community Solar projects, driving strategy and initiatives that optimize the financial health of these systems\nPartner with the data team to build, and maintain the metrics required to track the health of your projects and ensure obligations are being met\nDevelop market-specific SOPs in partnership with the Director, Rev Ops, and team leads across the globe\nOwn the relationship with utility representatives to ensure that: \n\nWe maintain accurate and complete subscriptions for all projects under management\nThere is an appropriate escalation path for the billing team to navigate billing and crediting issues \n\nAd-hoc/problem-solving of key market, developer, and financing issues\nComplete requests when same-day delivery is required \nWork extensively with Client facing team to ensure\n\nClient goals are being met \nProjects are prioritized appropriately\nUtility blockers and issues are communicated effectively \nMarket-specific requirements are fully understood and can be communicated back to client \n\nEnsure we comply with all market-specific regulations and reporting requirements \nBecome a community solar subject matter expert and contribute to maintaining our knowledgebase of utility-specific operating procedures and regulations\nWork extensively with billing and credit reconciliation teams to understand under-performance, host bill results, host banked credit amounts, and adjust strategy as needed\nCollaborate with a global team to ensure the timely delivery of contractual obligations\nWork with the waitlisting/onboarding team to ensure projects are 100% subscribed \n\nWhat will help you succeed:\n\nMust-haves:\n\nBachelor’s Degree\nExcellent excel skills with theability to extract and convey themes to internal and external stakeholders from large data sets\nDemonstrated experience aligning and influencing cross-functional teams and diverse stakeholders\nAdvanced project management skills\nProactive communication style\nProven ability to break down complex problems and implement iterative solutions\nA growth mindset and comfort with ambiguity\nRigorous attention to detail\nHave a passion for clean energy and an interest in helping to better the environment\n\nNice-to-haves:\n\nStrong preference will be given to those with 3+ years working in the energy industry \nProficiency in SQL and HEX\n\nBenefits:\n\n\"Remote first\" culture - work anywhere in the US as long as you have a reliable internet connection\nFlexible PTO - no accrued hours and no limit on the number of vacation days exempt employees can take each year\n17 annual company-wide holidays including a week-long \"summer break\"\n10 days sick leave\nUp to 4 weeks bereavement leave\n2 volunteer days off\n2 professional development days off\n12 weeks paid parental leave for all parents\n80-95% employer cost coverage for medical, dental, and vision benefits for employees and dependents\n\nEliminating carbon footprints, eliminating carbon copies.\n\nHere at Arcadia, we cultivate diversity, celebrate individuality, and believe unique perspectives are key to our collective success in creating a clean energy future. Arcadia is committed to equal employment opportunities regardless of race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, protected veteran status, or any status protected by applicable federal, state, or local law. Please note that we are unable to offer visa sponsorship for this position at this time\n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation by emailing careers@arcadia.com.\n\nTarget Annual Compensation Range for this role will be $85,000 to $145,000. There will also be a competitive benefits and equity (bonus if applicable) component to the package. The exact compensation at which this job is filled will be determined by the skills, experience, and location of the qualified candidate.\n\nThank you\n\nApply for this job*\n\nindicates a required field\n\nFirst Name*Last Name*Preferred First NameEmail*Phone*Location (City)Locate meResume/CV*AttachAttachDropboxGoogle DriveEnter manuallyEnter manuallyAccepted file types: pdf, doc, docx, txt, rtf\n\nCover LetterAttachAttachDropboxGoogle DriveEnter manuallyEnter manuallyAccepted file types: pdf, doc, docx, txt, rtf\n\nEducation\n\nSchool*Select...Degree*Select...DisciplineSelect...Add anotherAre you legally eligible to work in the U.S.?*Select...Will you now or in the future require visa sponsorship for employment at Arcadia?*Select...While we are currently unable to consider candidates who will require visa sponsorship, we welcome applications from all qualified candidates eligible to work in the United States.\n\nDo you currently live in the U.S.?*Select...If Yes, what state do you currently live in?Select...What are your pronouns? (optional)Arcadia Self-Identification QuestionsFor government reporting purposes, we ask candidates to respond to the below self-identification survey. Whatever your decision, it will not be considered in the hiring process or thereafter. Any information that you do provide will be recorded and maintained in a confidential file.\n\nAs set forth in Arcadia&rsquo;s Equal Employment Opportunity policy, we do not discriminate on the basis of any protected group status under any applicable law.\n\n---\n\nIf you believe you belong to any of the categories of protected veterans listed below, please indicate by making the appropriate selection. As a government contractor subject to the Vietnam Era Veterans Readjustment Assistance Act (VEVRAA), we request this information in order to measure the effectiveness of the outreach and positive recruitment efforts we undertake pursuant to VEVRAA. Classification of protected categories is as follows:\n\nA \"disabled veteran\" is one of the following: a veteran of the U.S. military, ground, naval or air service who is entitled to compensation (or who but for the receipt of military retired pay would be entitled to compensation) under laws administered by the Secretary of Veterans Affairs; or a person who was discharged or released from active duty because of a service-connected disability.\n\nA \"recently separated veteran\" means any veteran during the three-year period beginning on the date of such veteran's discharge or release from active duty in the U.S. military, ground, naval, or air service.\n\nAn \"active duty wartime or campaign badge veteran\" means a veteran who served on active duty in the U.S. military, ground, naval or air service during a war, or in a campaign or expedition for which a campaign badge has been authorized under the laws administered by the Department of Defense.\n\nAn \"Armed forces service medal veteran\" means a veteran who, while serving on active duty in the U.S. military, ground, naval or air service, participated in a United States military operation for which an Armed Forces service medal was awarded pursuant to Executive Order 12985.\n\n---\n\nVoluntary Self-Identification of Disability\nWhy are you being asked to complete this form?\n\nWe are required to measure our progress toward having at least 7% of our workforce be individuals with disabilities. To do this, we must ask applicants and employees if they have a disability or have ever had a disability. Because a person may become disabled at any time, we ask all of our employees to update their information at least every five years.\n\nIdentifying yourself as an individual with a disability is voluntary, and we hope that you will choose to do so. Your answer will be maintained confidentially and not be seen by selecting officials or anyone else involved in making personnel decisions. Completing the form will not negatively impact you in any way, regardless of whether you have self-identified in the past. For more information about this form or the equal employment obligations of federal contractors under Section 503 of the Rehabilitation Act, visit the U.S. Department of Labor&rsquo;s Office of Federal Contract Compliance Programs (OFCCP) website at www.dol.gov/ofccp.\n\nHow do you know if you have a disability?\n\nYou are considered to have a disability if you have a physical or mental impairment or medical condition that substantially limits a major life activity, or if you have a history or record of such an impairment or medical condition.\n\nDisabilities include, but are not limited to:\n\nAutism\nAutoimmune disorder, for example, lupus, fibromyalgia, rheumatoid arthritis, or HIV/AIDS\nBlind or low vision\nCancer\nCardiovascular or heart disease\nCeliac disease\nCerebral palsy\nDeaf or hard of hearing\nDepression or anxiety\nDiabetes\nEpilepsy\nGastrointestinal disorders, for example, Crohn's Disease, or irritable bowel syndrome\nIntellectual disability\nMissing limbs or partially missing limbs\nNervous system condition for example, migraine headaches, Parkinson&rsquo;s disease, or Multiple sclerosis (MS)\nPsychiatric condition, for example, bipolar disorder, schizophrenia, PTSD, or major depression\nGender or Gender Identity*Select...Please identify your race and/or ethnicity. Please check all that apply:*Select...Veteran Service Status: *Select...Disability Status*Select...Submit applicationPowered by\n\nGreenhouseRead our Privacy Policy"
  },
  "4fkmf1": {
    "jobTitle": "Product Strategist",
    "companyName": "Gecko Robotics",
    "introText": "I'm the right person for the Product Strategist due to my experience in leading product vision and program management for multiple product lines, resulting in a 150% ARR growth within 6 months at CloudKitchens.",
    "bulletPoints": [
      "**Product Leadership:** While I was Product Manager at CloudKitchens, I took the Otter Lockers product from concept to market, achieving a 150% growth in ARR in just 6 months.",
      "**Team Management:** While I was Regional Manager at Ritual, I built and managed a team of 4 City Managers across North America, launching operations in 3 major US markets with over $1M+ monthly GMV each.",
      "**Cross-functional Collaboration:** While I was Growth Operations Manager at Countable, I orchestrated cross-functional collaborations and established strategic partnerships, leading to 150%+ growth in partnerships.",
      "**Data-Driven Decisions:** While I was Product Manager at CloudKitchens, I developed SQL queries and dashboards to help teams make data-driven decisions, reducing support escalations by 80%."
    ],
    "relevantSkills": [
      "Product Vision and Strategy",
      "Cross-functional Team Leadership",
      "Data Analysis and SQL",
      "Strategic Partnerships",
      "Growth and Scaling Operations"
    ],
    "jobContent": "Careers | Gecko Robotics | Gecko Robotics\n\nskip to content\n\nGecko Robotics\n\n Toggle Main Navigation\n\n Cantilever®\n\n AIR\n\n Industries\n\n Defense\n\n Energy\n\n Oil & Gas\n \n Power\n\n Manufacturing\n\n Pulp & Paper\n \n Steel\n \n Mining\n\n Careers\n\n Log In\n \n Contact\n\n Log In\n\n Contact\n\n Careers\n\n Explore How the World Runs\nAnd Make It Better\n\n Open Roles\n\n We’re changing the way engineering and robotics connect to the built world\n\n We need creative problem solvers to help accelerate our mission. \n\n We believe it’s time for a new kind of engineering role capable of building technology to address the needs of the physical world. We want engineers who are not limited by discipline, and who aspire to wield a wide variety of skills, from software, data, and algorithms to firmware, robot integration, and mechanical engineering. Does this sound like you?\n\nWe have many open positions below, but if you do not fall into one category or feel like your approach to engineering is more expansive, we still want to talk to you. Sign up to receive updates and be notified when we begin actively hiring for this new kind of engineering position in early 2025!\n\n Receive Updates\n\n Make a Real Impact\n\n With innovative robotics technologies and software solutions, your work will help the world’s most vital industries and institutions solve their biggest challenges to create a stronger, safer, and more resilient future.\n\n Our Robots are \nPowered by Humans\n\n Join Our Team\n\n Both behind the scenes and in the field, we bring together the brightest minds to drive what's possible. Join our diverse team to be at the forefront of innovation and transformation.\n\n Our Mission\n\n Ensuring the availability, reliability, and sustainability of critical infrastructure.\n\n At Gecko Robotics, we help the world’s most important organizations understand and protect their physical assets. \n\nThrough advanced robotics and enterprise software solutions, we provide unprecedented insight into the health of critical infrastructure assets, enabling data-driven decision making.\n\nWe are a team of innovators, driven by solving complex problems in energy, manufacturing, defense, and other critical industries.\n\nWe ideate, create, iterate, and inform, providing the tools and solutions to drive responsible asset management at scale.\n\n People at Gecko really take pride in the work that they do and really resonate with the mission statement. It translates into everything and into all facets of the company.\n\n Antony Tahan\n Forward Deployed Engineer\n\n Open Roles\n 16 Careers\n\n Search\n\n Filter by Department\n \n All Teams\n Engineering\n \n Finance\n \n Operations\n \n People \n \n Product\n \n Robotics\n \n Software\n\n Filter by Location\n \n All locations\n Boston\n \n Houston\n \n New York City\n \n Pittsburgh\n \n Salt Lake City\n \n Washington, D.C.\n\n API Inspector\n\n Operations\n\n Salt Lake City\n\n View Details >\n\n Communications Specialist, Internal\n\n People \n\n New York City\n\n View Details >\n\n Data Analytics Engineer\n\n Operations\n\n New York City\n\n View Details >\n\n Deployment Lead\n\n Engineering\n\n New York City, Washington, D.C., Houston, Boston\n\n View Details >\n\n Executive Assistant\n\n People \n\n New York City, Pittsburgh\n\n View Details >\n\n Forward Deployed Operations Engineer \n\n Operations\n\n Pittsburgh\n\n View Details >\n\n Forward Deployed Software Engineer\n\n Engineering\n\n New York City, Washington, D.C., Pittsburgh\n\n View Details >\n\n NDT Advanced Specialist \n\n Operations\n\n Houston\n\n View Details >\n\n Product Strategist\n\n Product\n\n New York City, Washington, D.C.\n\n View Details >\n\n Robot Field Operator\n\n Operations\n\n Pittsburgh, Houston\n\n View Details >\n\n Senior Electrical Engineer \n\n Engineering\n\n Pittsburgh\n\n View Details >\n\n Senior Localization Engineer \n\n Engineering\n\n Pittsburgh\n\n View Details >\n\n Software Engineer \n\n Software\n\n Boston\n\n View Details >\n\n Staff Accountant\n\n Finance\n\n Pittsburgh\n\n View Details >\n\n Test & Reliability Engineer System Testing \n\n Robotics\n\n Pittsburgh\n\n View Details >\n\n Test & Reliability Engineer Triage and Support\n\n Robotics\n\n Pittsburgh\n\n View Details >\n\n No jobs match your search.\n\n Company Awards\n\n Close\n\nGecko Robotics\n\n SolutionsCantilever®AIRIndustriesDefenseOil & GasPowerPulp & PaperSteelMiningCompanyCareersContactPrivacyNewsResourcesBlogCase Studies\n\n info@geckorobotics.com\n888.350.8960Update Cookie Preferences\n\n Copyright © 2025\nGecko Robotics, Inc.\n All Rights Reserved."
  },
  "m47m2l": {
    "jobTitle": "Product Strategist",
    "companyName": "Gecko Robotics",
    "introText": "I'm the right person for the Product Strategist at Gecko Robotics because I led growth strategies that increased restaurant partner retention by 40% and grew monthly active users by 300% across 15+ markets at Ritual.",
    "bulletPoints": [
      "**Forward-Thinking Leadership:** While I was a Product Manager at CloudKitchens, I took Otter Lockers product 0 → 1, growing ARR 150% in 6 months.",
      "**Scalable Solutions:** While I was a Regional Manager at Ritual, I launched and scaled operations in 3 major US markets, each achieving $1M+ monthly GMV.",
      "**Team Management:** While I was a Regional Manager at Ritual, I built and managed a team of 4 City Managers across North America.",
      "**Strategic Growth:** While I was a Growth Operations Manager at Countable, I led D.C. business development efforts, resulting in 150%+ growth through partnerships.",
      "**Data-Driven Insight:** While I was a Product Manager at CloudKitchens, I developed SQL queries and dashboards to help teams make data-driven decisions."
    ],
    "relevantSkills": [
      "Strategic Planning",
      "Cross-Functional Leadership",
      "Market Expansion",
      "Data Analysis",
      "Team Management"
    ],
    "jobContent": "Careers | Gecko Robotics | Gecko Robotics\n\nskip to content\n\nGecko Robotics\n\n Toggle Main Navigation\n\n Cantilever®\n\n AIR\n\n Industries\n\n Defense\n\n Energy\n\n Oil & Gas\n \n Power\n\n Manufacturing\n\n Pulp & Paper\n \n Steel\n \n Mining\n\n Careers\n\n Log In\n \n Contact\n\n Log In\n\n Contact\n\n Careers\n\n Explore How the World Runs\nAnd Make It Better\n\n Open Roles\n\n We’re changing the way engineering and robotics connect to the built world\n\n We need creative problem solvers to help accelerate our mission. \n\n We believe it’s time for a new kind of engineering role capable of building technology to address the needs of the physical world. We want engineers who are not limited by discipline, and who aspire to wield a wide variety of skills, from software, data, and algorithms to firmware, robot integration, and mechanical engineering. Does this sound like you?\n\nWe have many open positions below, but if you do not fall into one category or feel like your approach to engineering is more expansive, we still want to talk to you. Sign up to receive updates and be notified when we begin actively hiring for this new kind of engineering position in early 2025!\n\n Receive Updates\n\n Make a Real Impact\n\n With innovative robotics technologies and software solutions, your work will help the world’s most vital industries and institutions solve their biggest challenges to create a stronger, safer, and more resilient future.\n\n Our Robots are \nPowered by Humans\n\n Join Our Team\n\n Both behind the scenes and in the field, we bring together the brightest minds to drive what's possible. Join our diverse team to be at the forefront of innovation and transformation.\n\n Our Mission\n\n Ensuring the availability, reliability, and sustainability of critical infrastructure.\n\n At Gecko Robotics, we help the world’s most important organizations understand and protect their physical assets. \n\nThrough advanced robotics and enterprise software solutions, we provide unprecedented insight into the health of critical infrastructure assets, enabling data-driven decision making.\n\nWe are a team of innovators, driven by solving complex problems in energy, manufacturing, defense, and other critical industries.\n\nWe ideate, create, iterate, and inform, providing the tools and solutions to drive responsible asset management at scale.\n\n People at Gecko really take pride in the work that they do and really resonate with the mission statement. It translates into everything and into all facets of the company.\n\n Antony Tahan\n Forward Deployed Engineer\n\n Open Roles\n 16 Careers\n\n Search\n\n Filter by Department\n \n All Teams\n Engineering\n \n Finance\n \n Operations\n \n People \n \n Product\n \n Robotics\n \n Software\n\n Filter by Location\n \n All locations\n Boston\n \n Houston\n \n New York City\n \n Pittsburgh\n \n Salt Lake City\n \n Washington, D.C.\n\n API Inspector\n\n Operations\n\n Salt Lake City\n\n View Details >\n\n Communications Specialist, Internal\n\n People \n\n New York City\n\n View Details >\n\n Data Analytics Engineer\n\n Operations\n\n New York City\n\n View Details >\n\n Deployment Lead\n\n Engineering\n\n New York City, Washington, D.C., Houston, Boston\n\n View Details >\n\n Executive Assistant\n\n People \n\n New York City, Pittsburgh\n\n View Details >\n\n Forward Deployed Operations Engineer \n\n Operations\n\n Pittsburgh\n\n View Details >\n\n Forward Deployed Software Engineer\n\n Engineering\n\n New York City, Washington, D.C., Pittsburgh\n\n View Details >\n\n NDT Advanced Specialist \n\n Operations\n\n Houston\n\n View Details >\n\n Product Strategist\n\n Product\n\n New York City, Washington, D.C.\n\n View Details >\n\n Robot Field Operator\n\n Operations\n\n Pittsburgh, Houston\n\n View Details >\n\n Senior Electrical Engineer \n\n Engineering\n\n Pittsburgh\n\n View Details >\n\n Senior Localization Engineer \n\n Engineering\n\n Pittsburgh\n\n View Details >\n\n Software Engineer \n\n Software\n\n Boston\n\n View Details >\n\n Staff Accountant\n\n Finance\n\n Pittsburgh\n\n View Details >\n\n Test & Reliability Engineer System Testing \n\n Robotics\n\n Pittsburgh\n\n View Details >\n\n Test & Reliability Engineer Triage and Support\n\n Robotics\n\n Pittsburgh\n\n View Details >\n\n No jobs match your search.\n\n Company Awards\n\n Close\n\nGecko Robotics\n\n SolutionsCantilever®AIRIndustriesDefenseOil & GasPowerPulp & PaperSteelMiningCompanyCareersContactPrivacyNewsResourcesBlogCase Studies\n\n info@geckorobotics.com\n888.350.8960Update Cookie Preferences\n\n Copyright © 2025\nGecko Robotics, Inc.\n All Rights Reserved."
  },
  "uaxe4x": {
    "jobTitle": "Senior Electrical Engineer",
    "companyName": "Gecko Robotics",
    "introText": "I'm the right person for the Senior Electrical Engineer at Gecko Robotics because I scaled autonomous robotics systems to 100+ facilities in 18 months while maintaining high NPS scores.",
    "bulletPoints": [
      "**Scalable Systems:** While I was Product Manager at CloudKitchens, I scaled autonomous robotics systems to 100+ facilities in 18 months while keeping NPS scores above 90.",
      "**Engineering Leadership:** In my role at CloudKitchens, I directed a remote team of 10 engineers, designers, and data scientists to ship robotics and food delivery products.",
      "**Cross-functional Expertise:** At Ritual, I served as the voice of the customer to product and engineering teams, influencing roadmap priorities for 15+ markets.",
      "**Robotics Integration:** During my time at CloudKitchens, I led product vision and program management for five distinct product lines, including robotics.",
      "**Rapid Growth:** As Regional Manager at Ritual, I grew monthly active users by 300% across 15+ markets in the first year."
    ],
    "relevantSkills": [
      "Robotics Systems Integration",
      "Engineering Leadership",
      "Cross-functional Collaboration",
      "Product Vision and Strategy",
      "Scalable Technology Solutions"
    ],
    "jobContent": "Careers | Gecko Robotics | Gecko Robotics\n\nskip to content\n\nGecko Robotics\n\n Toggle Main Navigation\n\n Cantilever®\n\n AIR\n\n Industries\n\n Defense\n\n Energy\n\n Oil & Gas\n \n Power\n\n Manufacturing\n\n Pulp & Paper\n \n Steel\n \n Mining\n\n Careers\n\n Log In\n \n Contact\n\n Log In\n\n Contact\n\n Careers\n\n Explore How the World Runs\nAnd Make It Better\n\n Open Roles\n\n We’re changing the way engineering and robotics connect to the built world\n\n We need creative problem solvers to help accelerate our mission. \n\n We believe it’s time for a new kind of engineering role capable of building technology to address the needs of the physical world. We want engineers who are not limited by discipline, and who aspire to wield a wide variety of skills, from software, data, and algorithms to firmware, robot integration, and mechanical engineering. Does this sound like you?\n\nWe have many open positions below, but if you do not fall into one category or feel like your approach to engineering is more expansive, we still want to talk to you. Sign up to receive updates and be notified when we begin actively hiring for this new kind of engineering position in early 2025!\n\n Receive Updates\n\n Make a Real Impact\n\n With innovative robotics technologies and software solutions, your work will help the world’s most vital industries and institutions solve their biggest challenges to create a stronger, safer, and more resilient future.\n\n Our Robots are \nPowered by Humans\n\n Join Our Team\n\n Both behind the scenes and in the field, we bring together the brightest minds to drive what's possible. Join our diverse team to be at the forefront of innovation and transformation.\n\n Our Mission\n\n Ensuring the availability, reliability, and sustainability of critical infrastructure.\n\n At Gecko Robotics, we help the world’s most important organizations understand and protect their physical assets. \n\nThrough advanced robotics and enterprise software solutions, we provide unprecedented insight into the health of critical infrastructure assets, enabling data-driven decision making.\n\nWe are a team of innovators, driven by solving complex problems in energy, manufacturing, defense, and other critical industries.\n\nWe ideate, create, iterate, and inform, providing the tools and solutions to drive responsible asset management at scale.\n\n People at Gecko really take pride in the work that they do and really resonate with the mission statement. It translates into everything and into all facets of the company.\n\n Antony Tahan\n Forward Deployed Engineer\n\n Open Roles\n 16 Careers\n\n Search\n\n Filter by Department\n \n All Teams\n Engineering\n \n Finance\n \n Operations\n \n People \n \n Product\n \n Robotics\n \n Software\n\n Filter by Location\n \n All locations\n Boston\n \n Houston\n \n New York City\n \n Pittsburgh\n \n Salt Lake City\n \n Washington, D.C.\n\n API Inspector\n\n Operations\n\n Salt Lake City\n\n View Details >\n\n Communications Specialist, Internal\n\n People \n\n New York City\n\n View Details >\n\n Data Analytics Engineer\n\n Operations\n\n New York City\n\n View Details >\n\n Deployment Lead\n\n Engineering\n\n New York City, Washington, D.C., Houston, Boston\n\n View Details >\n\n Executive Assistant\n\n People \n\n New York City, Pittsburgh\n\n View Details >\n\n Forward Deployed Operations Engineer \n\n Operations\n\n Pittsburgh\n\n View Details >\n\n Forward Deployed Software Engineer\n\n Engineering\n\n New York City, Washington, D.C., Pittsburgh\n\n View Details >\n\n NDT Advanced Specialist \n\n Operations\n\n Houston\n\n View Details >\n\n Product Strategist\n\n Product\n\n New York City, Washington, D.C.\n\n View Details >\n\n Robot Field Operator\n\n Operations\n\n Pittsburgh, Houston\n\n View Details >\n\n Senior Electrical Engineer \n\n Engineering\n\n Pittsburgh\n\n View Details >\n\n Senior Localization Engineer \n\n Engineering\n\n Pittsburgh\n\n View Details >\n\n Software Engineer \n\n Software\n\n Boston\n\n View Details >\n\n Staff Accountant\n\n Finance\n\n Pittsburgh\n\n View Details >\n\n Test & Reliability Engineer System Testing \n\n Robotics\n\n Pittsburgh\n\n View Details >\n\n Test & Reliability Engineer Triage and Support\n\n Robotics\n\n Pittsburgh\n\n View Details >\n\n No jobs match your search.\n\n Company Awards\n\n Close\n\nGecko Robotics\n\n SolutionsCantilever®AIRIndustriesDefenseOil & GasPowerPulp & PaperSteelMiningCompanyCareersContactPrivacyNewsResourcesBlogCase Studies\n\n info@geckorobotics.com\n888.350.8960Update Cookie Preferences\n\n Copyright © 2025\nGecko Robotics, Inc.\n All Rights Reserved."
  },
  "ebxyht": {
    "jobTitle": "Product Manager",
    "companyName": "Meta",
    "introText": "I'm the right person for the Product Manager at Meta because I have extensive experience leading cross-functional teams to develop transformative products, managing the full product life-cycle, and driving strategic initiatives with a focus on user satisfaction and market impact.",
    "bulletPoints": [
      "**Product Vision:** While I was Product Manager at CloudKitchens, I led the product vision and GTM strategy for five distinct product lines, significantly impacting the company's growth trajectory.",
      "**Team Leadership:** As a Regional Manager at Ritual, I built and managed a team of 4 City Managers across North America, successfully scaling operations in multiple markets.",
      "**Data-Driven Insights:** At Countable, I integrated market analysis and usability studies into product strategies, resulting in feature placements on the App Store and significant user engagement growth.",
      "**Cross-Functional Collaboration:** During my tenure at Uber, I collaborated with local regulators and cross-functional teams to launch and scale major markets in North Carolina, establishing key partnerships with universities and businesses.",
      "**Entrepreneurial Execution:** At CloudKitchens, I took the Otter Lockers product from 0 to 1, achieving a 150% ARR growth in just 6 months."
    ],
    "relevantSkills": [
      "Product Strategy",
      "Cross-functional Leadership",
      "Product Requirements & Specs",
      "A/B Testing & Experimentation",
      "Roadmap Planning"
    ],
    "jobContent": "Meta Product Managers work with cross-functional teams of engineers, designers, data scientists and researchers to build products. We are looking for extremely entrepreneurial Product Managers to help innovate and execute product initiatives across the company and value moving quickly. This job description represents different full-time roles across Meta.\nProduct Manager Responsibilities\nIs the primary driver for identifying significant near and long-term opportunities in a large Product area, and driving product vision, strategies and roadmaps in the context of broader organizational strategies and goals.\nGenerate buy-in and drives consensus across organizations. Bring clarity and structure to ambiguous opportunities. Consistently demonstrate initiative and execute with limited oversight.\nPlan, initiate, and manage information technology projects for web-based products, applications, and platforms.\nIntegrate data, usability studies, research, and market analysis into product strategies and requirements to enhance user satisfaction and improve engineer productivity.\nDrive product development with teams of world-class engineers and designers, while maintaining team health.\nUnderstand Meta’s strategic and competitive position and deliver products that are aligned with our mission and recognized best in the industry.\nWork closely with cross-functional teams to drive product vision, define product requirements, coordinate resources from other groups (design, legal, etc.), develop roadmaps, and guide the team through key milestones.\nDefine and analyze metrics that inform the success of products. Identify and track key performance metrics. Drive decision-making through user insights, quantitative analysis and AB testing.\nMaximize efficiency in a constantly evolving environment where the process is fluid and creative solutions are the norm.\nMinimum Qualifications\n10+ years product management and/or Product Design\n10+ years of experience working collaboratively with engineering, design and user research teams\nExperience navigating through the full product life-cycle, integrating customer feedback into product requirements, driving prioritization, and pre/post-launch execution\nCritical thinking/analytical leadership experience\nExperience presenting to senior executive audiences\nBA/BS in Computer Science or related field\nPreferred Qualifications\nExperience in a consumer focused technology company\nExperience building 0-1 products, platform/ecosystem products, or marketplaces"
  },
  "4zbaci": {
    "jobTitle": "Product Manager",
    "companyName": "Meta",
    "introText": "I'm the right person for the Product Manager at Meta because I have extensive experience leading cross-functional teams to execute transformative product initiatives and thrive in fast-paced environments.",
    "bulletPoints": [
      "**Growth Leader:** While I was Product Manager at CloudKitchens, I took the Otter Lockers product from 0 to 1, achieving a 150% increase in ARR within six months.",
      "**Scale Architect:** While I was Product Manager at CloudKitchens, I scaled autonomous robotics systems to 100+ facilities in 18 months while maintaining NPS scores above 90.",
      "**Efficiency Enhancer:** While I was Product Manager at CloudKitchens, I reduced facility technology support escalations by 80% through implementing self-serve ops tooling."
    ],
    "relevantSkills": [
      "Product Strategy",
      "Cross-functional Leadership",
      "Roadmap Planning",
      "Product Requirements & Specs",
      "A/B Testing & Experimentation"
    ],
    "jobContent": "Meta Product Managers work with cross-functional teams of engineers, designers, data scientists and researchers to build products. We are looking for extremely entrepreneurial Product Managers to help innovate and execute product initiatives across the company and value moving quickly. This job description represents different full-time roles across Meta.\nProduct Manager Responsibilities\nIs the primary driver for identifying significant near and long-term opportunities in a large Product area, and driving product vision, strategies and roadmaps in the context of broader organizational strategies and goals.\nGenerate buy-in and drives consensus across organizations. Bring clarity and structure to ambiguous opportunities. Consistently demonstrate initiative and execute with limited oversight.\nPlan, initiate, and manage information technology projects for web-based products, applications, and platforms.\nIntegrate data, usability studies, research, and market analysis into product strategies and requirements to enhance user satisfaction and improve engineer productivity.\nDrive product development with teams of world-class engineers and designers, while maintaining team health.\nUnderstand Meta’s strategic and competitive position and deliver products that are aligned with our mission and recognized best in the industry.\nWork closely with cross-functional teams to drive product vision, define product requirements, coordinate resources from other groups (design, legal, etc.), develop roadmaps, and guide the team through key milestones.\nDefine and analyze metrics that inform the success of products. Identify and track key performance metrics. Drive decision-making through user insights, quantitative analysis and AB testing.\nMaximize efficiency in a constantly evolving environment where the process is fluid and creative solutions are the norm.\nMinimum Qualifications\n10+ years product management and/or Product Design\n10+ years of experience working collaboratively with engineering, design and user research teams\nExperience navigating through the full product life-cycle, integrating customer feedback into product requirements, driving prioritization, and pre/post-launch execution\nCritical thinking/analytical leadership experience\nExperience presenting to senior executive audiences\nBA/BS in Computer Science or related field\nPreferred Qualifications\nExperience in a consumer focused technology company\nExperience building 0-1 products, platform/ecosystem products, or marketplaces"
  }
}